---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MaterialAssetParamCommonSharedAsset
source: html/f226f6fe-26b7-7f96-2558-774478369b21.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MaterialAssetParamCommonSharedAsset Property

"Sharing"

## Syntax (C#)
```csharp
public static ForgeTypeId MaterialAssetParamCommonSharedAsset { get; }
```